VojislavM/nrf52-saadc-conf/main.c
    // Build and set advertising data.
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type             = BLE_ADVDATA_FULL_NAME;
    advdata.flags                 = flags;
    advdata.p_manuf_specific_data = &manuf_specific_data;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);


    // Initialize advertising parameters (used when starting advertising).
    memset(&m_adv_params, 0, sizeof(m_adv_params));

    m_adv_params.properties.type = BLE_GAP_ADV_TYPE_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED;
    m_adv_params.p_peer_addr     = NULL;    // Undirected advertisement.
    m_adv_params.filter_policy   = BLE_GAP_ADV_FP_ANY;
    m_adv_params.interval        = ADV_DEFAULT_INTERVAL_MS;
    m_adv_params.duration        = 0;       // Never time out.

    err_code = ble_advdata_encode(&advdata, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &m_adv_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    ret_code_t err_code;

    err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);

    // no indication for adv
    //err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
    //APP_ERROR_CHECK(err_code);
}

/**@brief Function for stoping advertising.
 */
static void advertising_stop(void)
{
    ret_code_t err_code;

    err_code = sd_ble_gap_adv_stop(m_adv_handle);
    APP_ERROR_CHECK(err_code);

    return;
}

static void advertising_parameters_update(int status){
    ret_code_t err_code;

    m_beacon_info[1] = status;
    manuf_specific_data.data.p_data = (uint8_t *) m_beacon_info;
    manuf_specific_data.data.size   = APP_BEACON_INFO_LENGTH;

    advdata.p_manuf_specific_data = &manuf_specific_data;
    
    err_code = ble_advdata_encode(&advdata, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &m_adv_params);
    APP_ERROR_CHECK(err_code);

    return;
}

static void advertising_parameters_battery_update(int battery){
    ret_code_t err_code;

    m_beacon_info[0] = battery;
    manuf_specific_data.data.p_data = (uint8_t *) m_beacon_info;
    manuf_specific_data.data.size   = APP_BEACON_INFO_LENGTH;

    advdata.p_manuf_specific_data = &manuf_specific_data;
    
    err_code = ble_advdata_encode(&advdata, m_adv_data.adv_data.p_data, &m_adv_data.adv_data.len);
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &m_adv_params);
    APP_ERROR_CHECK(err_code);

    return;
}

/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

    // Configure the BLE stack using the default settings.
    // Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing logging. */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Function for initializing LEDs. */
static void leds_init(void)
{
    //ret_code_t err_code = bsp_init(BSP_INIT_LEDS, NULL);
    nrf_gpio_cfg_output(USER_LED);
    //APP_ERROR_CHECK(err_code);
}

/**@brief Function for turning on led. */
static void user_led_on(void){
    //turn on user led
    nrf_gpio_pin_clear(USER_LED);
}

/**@brief Function for turning off led. */
static void user_led_off(void){
    //turn off user led
    nrf_gpio_pin_set(USER_LED);
}

/**@brief Function for initializing LEDs. */
static void power_pin_init(void)
{
    nrf_gpio_cfg_output(POWER_PIN);
}

/**@brief Function for turning on led. */
static void power_pin_on(void){
    //turn on user led
    nrf_gpio_pin_set(POWER_PIN);
}

/**@brief Function for turning off led. */
static void power_pin_off(void){
    //turn off user led
    nrf_gpio_pin_clear(POWER_PIN);
}


/**@brief Function for initializing the button handler module.*/
static void buttons_init(void)
{
    ret_code_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {USER_BUTTON, APP_BUTTON_ACTIVE_HIGH, NRF_GPIO_PIN_PULLDOWN, button_event_handler}
    };

    err_code = app_button_init(buttons, ARRAY_SIZE(buttons), BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);

}

/**@brief Function for initializing timers. */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

/**@brief Timeout handler for the repeated timer.
 */
static void repeated_timer_handler(void * p_context){
    //nrf_drv_gpiote_out_toggle(USER_LED);
    ret_code_t err_code;
    static bool buttonStatus = false;

    if(!buttonStatus){
        if(nrf_gpio_pin_read(USER_BUTTON) == 1){
            buttonStatus = true;
            user_led_on();
            // Stop the repeated timer.
            err_code = app_timer_stop(m_repeated_timer_id);
            APP_ERROR_CHECK(err_code);
            // start the timer
            err_code = app_timer_start(m_repeated_timer_id, APP_TIMER_TICKS(2000), NULL);
            APP_ERROR_CHECK(err_code);
        }
    }
    else{
        buttonStatus = false;
        user_led_off();
        // Stop the repeated timer.
        err_code = app_timer_stop(m_repeated_timer_id);
        APP_ERROR_CHECK(err_code);
        // Power OFF
        power_pin_off();
        while(1);
    }
    //nrf_drv_gpiote_out_toggle(POWER_PIN);
}

static void adc_timer_handler(void * p_context){
    NRF_LOG_INFO("timer_handler.");
    nrf_drv_saadc_sample();                                        //Trigger the SAADC SAMPLE task
}

void timer2_create(void){
    ret_code_t err_code;

    // Create timers
    err_code = app_timer_create(&m_repeated_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                repeated_timer_handler);
    APP_ERROR_CHECK(err_code);
}

void timer_adc_create(void){
    ret_code_t err_code;

    // Create timers
    err_code = app_timer_create(&m_timer_analog_values_id,
                                APP_TIMER_MODE_REPEATED,
                                adc_timer_handler);
    APP_ERROR_CHECK(err_code);
}

void saadc_callback(nrf_drv_saadc_evt_t const * p_event)
{
    ret_code_t err_code;
    if (p_event->type == NRF_DRV_SAADC_EVT_DONE)                                                        //Capture offset calibration complete event
    {
			
